// Підключення функціоналу "Чертоги Фрілансера"
import { isMobile } from './functions.js';
// Підключення списку активних модулів
import { flsModules } from './modules.js';

const POPUPS_DATA = [
	{
		title: 'Крейг Грошел',
		content: `
        Глобальний Лідерський Саміт – ключова лідерська подія в Україні та світі. Саміт щорічно відвідують пастори і служителі церков, керівники і співробітники  організацій, топ-менеджери компаній разом зі своїми командами, підприємці, студенти, політики, громадські діячі, службовці і військові. Усі вони вже стали каталізаторами найкращих змін у багатьох містах України. На Саміті ми плекаємо ваше натхнення, перезаряджаємо ваше бачення, спонукаємо до активних дій і розвиваємо навички безперервного удосконалення лідерства.`,
	},
	{
		title: 'Ервін МакМанус',
		content: `
        Глобальний Лідерський Саміт – ключова лідерська подія в Україні та світі. Саміт щорічно відвідують пастори і служителі церков, керівники і співробітники  організацій, топ-менеджери компаній разом зі своїми командами, підприємці, студенти, політики, громадські діячі, службовці і військові. Усі вони вже стали каталізаторами найкращих змін у багатьох містах України. На Саміті ми плекаємо ваше натхнення, перезаряджаємо ваше бачення, спонукаємо до активних дій і розвиваємо навички безперервного удосконалення лідерства.`,
	},
	{
		title: 'Артур Брукс',
		content: `
        Глобальний Лідерський Саміт – ключова лідерська подія в Україні та світі. Саміт щорічно відвідують пастори і служителі церков, керівники і співробітники  організацій, топ-менеджери компаній разом зі своїми командами, підприємці, студенти, політики, громадські діячі, службовці і військові. Усі вони вже стали каталізаторами найкращих змін у багатьох містах України. На Саміті ми плекаємо ваше натхнення, перезаряджаємо ваше бачення, спонукаємо до активних дій і розвиваємо навички безперервного удосконалення лідерства.`,
	},
	{
		title: 'Джоні Тада',
		content: `
        Глобальний Лідерський Саміт – ключова лідерська подія в Україні та світі. Саміт щорічно відвідують пастори і служителі церков, керівники і співробітники  організацій, топ-менеджери компаній разом зі своїми командами, підприємці, студенти, політики, громадські діячі, службовці і військові. Усі вони вже стали каталізаторами найкращих змін у багатьох містах України. На Саміті ми плекаємо ваше натхнення, перезаряджаємо ваше бачення, спонукаємо до активних дій і розвиваємо навички безперервного удосконалення лідерства.`,
	},
	{
		title: 'Кіндра Хол',
		content: `
        Глобальний Лідерський Саміт – ключова лідерська подія в Україні та світі. Саміт щорічно відвідують пастори і служителі церков, керівники і співробітники  організацій, топ-менеджери компаній разом зі своїми командами, підприємці, студенти, політики, громадські діячі, службовці і військові. Усі вони вже стали каталізаторами найкращих змін у багатьох містах України. На Саміті ми плекаємо ваше натхнення, перезаряджаємо ваше бачення, спонукаємо до активних дій і розвиваємо навички безперервного удосконалення лідерства.`,
	},
	{
		title: 'Ден Оволабі',
		content: `
        Глобальний Лідерський Саміт – ключова лідерська подія в Україні та світі. Саміт щорічно відвідують пастори і служителі церков, керівники і співробітники  організацій, топ-менеджери компаній разом зі своїми командами, підприємці, студенти, політики, громадські діячі, службовці і військові. Усі вони вже стали каталізаторами найкращих змін у багатьох містах України. На Саміті ми плекаємо ваше натхнення, перезаряджаємо ваше бачення, спонукаємо до активних дій і розвиваємо навички безперервного удосконалення лідерства.`,
	},
	{
		title: 'Вілл Гвідара',
		content: `
        Глобальний Лідерський Саміт – ключова лідерська подія в Україні та світі. Саміт щорічно відвідують пастори і служителі церков, керівники і співробітники  організацій, топ-менеджери компаній разом зі своїми командами, підприємці, студенти, політики, громадські діячі, службовці і військові. Усі вони вже стали каталізаторами найкращих змін у багатьох містах України. На Саміті ми плекаємо ваше натхнення, перезаряджаємо ваше бачення, спонукаємо до активних дій і розвиваємо навички безперервного удосконалення лідерства.`,
	},
	{
		title: 'Маркус Бекінгем',
		content: `
        Глобальний Лідерський Саміт – ключова лідерська подія в Україні та світі. Саміт щорічно відвідують пастори і служителі церков, керівники і співробітники  організацій, топ-менеджери компаній разом зі своїми командами, підприємці, студенти, політики, громадські діячі, службовці і військові. Усі вони вже стали каталізаторами найкращих змін у багатьох містах України. На Саміті ми плекаємо ваше натхнення, перезаряджаємо ваше бачення, спонукаємо до активних дій і розвиваємо навички безперервного удосконалення лідерства.`,
	},
	{
		title: 'Девід Ашкрафт',
		content: `
        Глобальний Лідерський Саміт – ключова лідерська подія в Україні та світі. Саміт щорічно відвідують пастори і служителі церков, керівники і співробітники  організацій, топ-менеджери компаній разом зі своїми командами, підприємці, студенти, політики, громадські діячі, службовці і військові. Усі вони вже стали каталізаторами найкращих змін у багатьох містах України. На Саміті ми плекаємо ваше натхнення, перезаряджаємо ваше бачення, спонукаємо до активних дій і розвиваємо навички безперервного удосконалення лідерства.`,
	},
	{
		title: 'Руслан Кухарчук',
		content: `
        Глобальний Лідерський Саміт – ключова лідерська подія в Україні та світі. Саміт щорічно відвідують пастори і служителі церков, керівники і співробітники  організацій, топ-менеджери компаній разом зі своїми командами, підприємці, студенти, політики, громадські діячі, службовці і військові. Усі вони вже стали каталізаторами найкращих змін у багатьох містах України. На Саміті ми плекаємо ваше натхнення, перезаряджаємо ваше бачення, спонукаємо до активних дій і розвиваємо навички безперервного удосконалення лідерства.`,
	},
];

function initPopups() {
	const speakers = document.querySelectorAll('.speaker');

	speakers.forEach((speaker, index) => {
		const popupData = POPUPS_DATA[index];

		if (!popupData) {
			console.error('Speakers count in html should equal POPUPS_DATA.length in js');

			return;
		}

		const speakerPopup = new Popup({
			id: `speaker${index}`,
			backgroundColor: '#009cde',
			titleColor: '#fff',
			textColor: '#fff',
            closeColor: '#fff',
			...popupData,
		});

		speaker.addEventListener('click', (e) => {
			if (e.target.closest('.speaker__image') || e.target.closest('.speaker__name-link')) {
				e.preventDefault();

				try {
					speakerPopup.show();
				} catch (e) {
					console.error('Popup is not ready yet.');
				}
			}
		});
	});
}

document.addEventListener('DOMContentLoaded', initPopups);
