// Підключення функціоналу "Чертоги Фрілансера"
import { isMobile } from './functions.js';
// Підключення списку активних модулів
import { flsModules } from './modules.js';

const POPUPS_DATA = [
	{
		title: 'Крейг Грошел',
		content: `
		<strong>Старший пастор і засновник Life.Church</strong>
		<p>
			Всесвітньо визнаний як лідер лідерів, Крейґ Ґрошел є засновником і старшим пастором церкви Life.Church, яка за його керівництва два роки поспіль була визнана журналом Glassdoor найкращим місцем для роботи у США. Відома своїм інноваційним підходом до використання сучасних технологій, Life.Church є розробником мобільного застосунку YouVersion Bible App, який встановлено на понад пів мільярда унікальних пристроїв по всьому світу. Він є ведучим найпопулярнішого подкасту про лідерство Craig Groeschel Leadership Podcast та автором бестселерів New York Times. Його остання книга – «Думай наперед: 7 рішень, які ти можеш прийняти сьогодні для благочестивого життя, яке бажаєш мати завтра». 
		</p>`,
	},
	{
		title: 'Ервін МакМанус',
		content: `
		<strong>Засновник церкви MOSAIC</strong>
		<p>
			Ервін Рафаель МакМанус – видатний автор і художник, лауреат численних премій. Його книги розійшлися накладом понад мільйон примірників і були перекладені більш ніж на десяток мов. Завдяки своєму креативному підходу він співпрацював з такими організаціями, як НФЛ і Пентагон. Протягом останніх трьох десятиліть МакМанус консультує генеральних директорів, професійних спортсменів, компанії з мільярдними доходами, університети та світових лідерів. Він відданий меті допомагати людям долати внутрішні обмеження та розкривати їхній особистий потенціал. Родом із Сальвадору, МакМанус також заснував міжнародну церкву Mosaic у Лос-Анджелесі, яка надихає мільйони людей в усьому світі. Він навчає лідерів, підприємців та комунікаторів через платформу The Arena та свій новаторський курс "Мистецтво комунікації". Його остання книга "7 частот комунікації" вийшла влітку 2024 року.
		</p>`,
	},
	{
		title: 'Артур Брукс',
		content: `
		<strong>Професор Гарвардського університету</strong>
		<p>
			Артур Брукс є професором управління громадськими та неприбутковими організаціями в Гарвардській школі Кеннеді та професором практичного менеджменту в Гарвардській школі бізнесу, де викладає курси з лідерства та щастя. Він також є колумністом журналу The Atlantic, де веде популярну рубрику «Як побудувати життя». Брукс є автором 13 книг, серед яких бестселер №1 за версією The New York Times 2023 року «Побудуй життя, яке ти хочеш: мистецтво і наука стати щасливішим», написаний у співавторстві з Опрою Вінфрі, а також бестселер №1 за версією The New York Times 2022 року «Від сили до сили: як досягти успіху, щастя і справжньої мети у другій половині життя». Він виступає перед аудиторіями по всьому світу на тему людського щастя та допомагає підвищити добробут в приватних компаніях, університетах, державних установах та громадських організаціях.
		</p>`,
	},
	{
		title: 'Джоні Тада',
		content: `
		<strong>Засновник і генеральний директор Joni & Friends</strong>
		<p>
			Джоні Еріксон Тада – визнаний світовий лідер у сфері захисту прав людей з інвалідністю, а також відома християнська письменниця. Незважаючи на те, що у 1967 році нещасний випадок під час пірнання призвів до її паралічу, вона вийшла з реабілітації з рішучістю допомагати іншим у подібних ситуаціях. Тада є генеральним директором організації «Joni and Friends», яка надає підтримку тисячам сімей, що стикаються з інвалідністю. Під час її роботи у Національній раді з питань інвалідності був прийнятий і підписаний Закон для людей з інвалідністю в США. Також Тада працювала у Комітеті з питань інвалідності при Державному секретарі США Конділізі Райс. Колсонівський центр християнського світогляду відзначив її престижною премією Вільяма Вілберфорса. Вона також отримала нагороду за видатні досягнення від Християнського альянсу лідерів. Тада є натхненним наставником для молоді з інвалідністю. Як ефективний комунікатор, вона поширює своє послання через книги, мистецтво, радіо та інші медіа.
		</p>`,
	},
	{
		title: 'Кіндра Хол',
		content: `
		<strong>Експерт зі сторітелінгу; автор бестселерів</strong>
		<p>
			Кіндра Холл – автор бестселерів та колишня директор зі сторітелінгу в журналі Success. Вона стала визнаним експертом з мистецтва сторітелінгу в бізнесі та не тільки. Про її дебютну книгу «Історії, які чіпляють» журнали Gartner та Forbes написали, що «можливо, це найцінніша бізнес-книга, яку ви прочитаєте». В травні 2024 року вийшла її нова книга під назвою «На вістрі історії: Як лідери використовують історії для успіху в бізнесі». Ця книга допомагає лідерам краще комунікувати і надихати свої команди та компанії. Холл займалася розробкою історій для таких глобальних брендів, як Target, Univision, United Way, USO і Farmers Insurance. Вона надихає команди та окремих людей краще розповідати про цінності їхньої компанії, продукти й унікальність за допомогою стратегічного сторітелінгу.
		</p>`,
	},
	{
		title: 'Ден Оволабі',
		content: `
		<strong>Виконавчий директор Branches Worldwide; пастор</strong>
		<p>
			Ден Оволабі – виконавчий директор Branches Worldwide, швидкозростаючої некомерційної організації, яка займається інвестуванням у високоефективних підприємців по всьому світу. Оволабі має майже 20 років досвіду у допомозі лідерам розвивати справжній та ефективний вплив. Він працював з лідерами у 18 країнах і на чотирьох континентах, допомагаючи їм чітко визначати свою ідентичність і використовувати свій вплив для служіння іншим. Остання книга Оволабі «Автентичне лідерство» стала бестселером №1 на Amazon. Він отримав ступінь магістра в Ешлендському університеті за спеціальністю «Американське лідерство» і завершує здобуття докторського ступеня з «Глобального лідерства» в Фуллерській теологічній семінарії.  
		</p>`,
	},
	{
		title: 'Вілл Гвідара',
		content: `
		<strong>Популяризатор гостинності; ресторатор; автор бестселерів</strong>
		<p>
			Вілл Гідара – автор бестселера New York Times «Надмірна гостинність», у якому він ділиться важливими уроками сервісу та лідерства, здобутими протягом кар'єри в ресторанному бізнесі. Він був співвласником ресторану Eleven Madison Park на Манхеттені, який під його керівництвом отримав чотири зірки від New York Times, три зірки Мішлен і в 2017 році був визнаний №1 у списку 50 найкращих ресторанів світу. Гідара також є ведучим Welcome Conference – щорічного форуму з гостинності, який об'єднує професіоналів для обміну ідеями та формування спільноти. Випускник Школи гостинності Корнельського університету, він є співавтором чотирьох кулінарних книг, був включений до рейтингу видання Crain's New York Business «40 до 40» та відзначений нагородою «Новатор» від журналу WSJ.
		</p>`,
	},
	{
		title: 'Маркус Бакінгем',
		content: `
		<strong>Міжнародний дослідник; підприємець; засновник Strengths Revolution</strong>
		<p>
			Маркус Бакінгем – найвідоміший у світі дослідник сильних сторін характеру, лідерства та високої продуктивності на роботі. Після 20 років вивчення досконалості та розробки інструменту StrengthsFinder у Gallup Organization він заснував власну компанію з розробки програмного забезпечення, яка допомагає лідерам команд досягати успіху.
		</p>
		<p>
			Сьогодні він очолює глобальні дослідження ADP Research Institute, присвячені вивченню людей та продуктивності на роботі. Бакінгем є автором двох бізнес-бестселерів усіх часів і двох найпопулярніших впливових статей у Harvard Business Review. Його здобутки ґрунтовно висвітлювалися в публікаціях The New York Times, Wall Street Journal, USA Today, Forbes, Fortune, The Today Show та The Oprah Winfrey Show. Його остання книга «Любов + робота» розкриває здатність любові виявляти справжню силу людини і вчить, як спрямувати цю силу на користь в особистому житті та роботі.
		</p>`,
	},
	{
		title: 'Девід Eшкрафт',
		content: `
		<strong>Президент і генеральний директор GLN</strong>
		<p>
			Девід Ешкрафт є президентом і генеральним директором Глобальної лідерської мережі (GLN) – організації з розвитку міжнародного лідерства, яка прагне служити пасторам, оснащувати церкви та надихати лідерів. Раніше Девід ніс служіння пастора церкви LCBC (Життя, змінені Христом) в Манхеймі, штат Пенсильванія. Під його керівництвом церква LCBC виросла з одного служіння зі 150 відвідувачами щотижня до 19 церков по всьому штату Пенсильванія з середньою щотижневою відвідуваністю понад 22 000 осіб. Крім того, Девід є засновником і президентом The Advantage, спільноти лідерів, метою якої є наставництво і заохочення пасторів по всій країні. Він є автором книги «Про що я думав?», яка вчить нас правильно ухвалювати рішення. Девід також є членом Ради директорів Глобальної лідерської мережі та Національної асоціації євангельських християн.
		</p>`,
	},
	{
		title: 'Руслан Кухарчук ',
		content: `
		<strong>ГЛС Україна, Національний партнер</strong>
		<p>
			Голова руху «Всі разом!» та аналітичного центру Кабінет експертів. Президент Асоціації журналістів «Новомедіа» та оргкомітету міжнародного Новомедіа Форуму. Лідер національного руху «Всі разом – за сім’ю». У різні періоди є співробітником українських телеканалів, а також друкованих і електронних ЗМІ у якості репортера, парламентського кореспондента, випускового редактора, ведучого, головного редактора. Промовець, викладач, проповідник. Автор трьох книг — «Десятка», «Мандат», «Секс після контузії». Співавтор і редактор книги «Новий журналіст». Має журналістську, режисерську та богословську освіту.
		</p>`,
	},
];

function initPopups() {
	const speakers = document.querySelectorAll('.speaker');

	speakers.forEach((speaker, index) => {
		const popupData = POPUPS_DATA[index];

		if (!popupData) {
			console.error('Speakers count in html should equal POPUPS_DATA.length in js');

			return;
		}

		const speakerPopup = new Popup({
			id: `speaker${index}`,
			backgroundColor: '#009cde',
			titleColor: '#fff',
			textColor: '#fff',
			closeColor: '#fff',
			...popupData,
		});

		speaker.addEventListener('click', (e) => {
			if (e.target.closest('.speaker__image') || e.target.closest('.speaker__name-link')) {
				e.preventDefault();

				try {
					speakerPopup.show();
				} catch (e) {
					console.error('Popup is not ready yet.');
				}
			}
		});
	});
}

document.addEventListener('DOMContentLoaded', initPopups);
